vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA132_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA132_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA132_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA132.condition_id" category="linkerScript" name="devices/MCXA132/arm/MCXA132_flash.scf" projectpath="MCXA132/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA132.condition_id" category="linkerScript" name="devices/MCXA132/arm/MCXA132_ram.scf" projectpath="MCXA132/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA132.condition_id" category="linkerScript" name="devices/MCXA132/gcc/MCXA132_flash.ld" projectpath="MCXA132/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA132.condition_id" category="linkerScript" name="devices/MCXA132/gcc/MCXA132_ram.ld" projectpath="MCXA132/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA132.condition_id" category="linkerScript" name="devices/MCXA132/iar/MCXA132_flash.icf" projectpath="MCXA132/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA132.condition_id" category="linkerScript" name="devices/MCXA132/iar/MCXA132_ram.icf" projectpath="MCXA132/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA132" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA132</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA132/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA132/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA132/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA132/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA132/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA132/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA132/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA132/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA132/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA132_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXA132/iar/startup_MCXA132.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXA132/gcc/startup_MCXA132.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXA132/arm/startup_MCXA132.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA132_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXA132_system</description>
      <files>
        <file category="sourceC" name="devices/MCXA132/system_MCXA132.c" projectpath="device"/>
        <file category="header" name="devices/MCXA132/system_MCXA132.h" projectpath="device"/>
        <file category="include" name="devices/MCXA132/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lpcac" Cversion="2.2.0" condition="driver.cache_lpcac_n4a_mcxn.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA132/drivers/fsl_cache_lpcac.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA132/drivers/fsl_cache_lpcac.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cdog" Cversion="2.1.3" condition="driver.cdog.condition_id">
      <description>cdog Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/drivers/fsl_cdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/drivers/fsl_cdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.0.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA132/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA132/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="GPIO" Csub="gpio_cmsis" Cversion="1.0.0" Capiversion="1.0.0" condition="driver.cmsis_gpio.condition_id">
      <description>GPIO CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/cmsis_drivers/fsl_gpio_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/cmsis_drivers/fsl_gpio_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MCXA132/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA132/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="sourceC" name="devices/MCXA132/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="header" name="devices/MCXA132/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA132/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA132/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA132/drivers/"/>
      </files>
    </component>
